# GetConnectorParameterValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPFamilyConnectorInfo..::..GetConnectorParameterValue Method
MEPFamilyConnectorInfo Class See Also
---
Gets the parameter value of the specified connector parameter id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ParameterValue GetConnectorParameterValue(
	ElementId connectorParameterId
)
```

Visual Basic
---
```text
Public Function GetConnectorParameterValue ( _
	connectorParameterId As ElementId _
) As ParameterValue
```

Visual C++
---
```text
public:
ParameterValue^ GetConnectorParameterValue(
	ElementId^ connectorParameterId
)
```

# ### Parameters
connectorParameterId
    Type: Autodesk.Revit.DB..::..ElementId connectorParameterId is defined in the family connector element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace